#include <stdio.h>

typedef struct Person {
	char name[10];
	char phone_num[20];
	char address[30];
} person;

typedef struct Professor {
	char name[30];
} professor;

typedef struct Student {
	person a;
	char school_num[30];
	float score;
	char major[30];
	char dream[30];
	professor b;
} student;

int main() {
	student c[10] = {
		{{"김영국", "011-4567-9834", "서울시 도곡동"}, "9952203", 4.20, "전자상거래", "공무원", {"최윤호"}},
		{{"강미연", "011-4567-9834", "서울시 도화동"}, "9952123", 3.50, "전산정보과", "회사원", {"홍길동"}},
		{{"송은혜", "011-4567-9834", "서울시 고척동"}, "9952108", 3.20, "비즈니스과", "회사원", {"박종학"}},
		{{"박보현", "011-4567-9834", "서울시 마곡동"}, "9952115", 3.00, "전자상거래", "프로게이머", {"이종석"}},
		{{"김미경", "011-4567-9834", "서울시 화곡동"}, "0052028", 4.10, "전자상거래", "웹마스터", {"신용현"}},
		{{"김형근", "011-4567-9834", "서울시 대치동"}, "0052029", 4.20, "비즈니스과", "웹디자이너", {"박종학"}},
		{{"배태준", "011-4567-9834", "서울시 마장동"}, "0052030", 4.30, "전자상거래", "군인", {"홍길동"}},
		{{"김보름", "011-4567-9834", "서울시 부평동"}, "0052031", 4.30, "전자상거래", "웹디자이너", {"최윤호"}},
		{{"서정순", "011-4567-9834", "서울시 도곡동"}, "0052032", 3.50, "비즈니스과", "웹마스터", {"이종석"}},
		{{"최종욱", "011-4567-9834", "서울시 도곡동"}, "0052033", 3.70, "비서과", "DB관리자", {"박종학"}}
	};

	printf(" 이 름     전 화 번 호       주소        학 번    평점     학 과      진 로     지도교수\n");

	for (int i = 0; i < 10; i++) {
		printf("%-8s %-15s %-15s %-8s %-5.2f %-12s %-10s %-10s\n",
			c[i].a.name, c[i].a.phone_num, c[i].a.address, c[i].school_num,
			c[i].score, c[i].major, c[i].dream, c[i].b.name);
	}

	return 0;
}
