#include <stdio.h>

typedef struct Person {
	char name[10];
	char school_num[11];
	float score;
	char major[20];
	char dream[20];
}person;


int main() {
	
	person a[10] = {
		{"김영국","9952203",4.2,"전자상거래","공무원"},
		{"강미연","9952123",3.5,"전자상거래","회사원" },
		{"송은혜","9952108",3.2,"전자상거래","회사원" },
		{"박보현","9952115",3.0,"전자상거래","프로게이머" },
		{"김미경","0052028",4.1,"전자상거래","웹마스터" },
		{"김형근","0052029",4.2,"전자상거래","웹디자이너" },
		{"배태준","0052030",4.3,"전자상거래","군인" },
		{"김보름","0052031",4.3,"전자상거래","웹디자이너" },
		{"서정순","0052032",3.5,"전자상거래","웹마스터" },
		{"최종욱","0052033",3.7,"전자상거래","DB관리자" }
	};

	printf("\n\n");

	printf("\t이 름\t\t학 번\t\t학 점\t\t학 과\t\t진 로\n\n");

	for (int i = 0; i < 10; i++) {
		printf("\t%s\t\t\b%s\t\t %.1f\t    %s\t\t%6s\n", a[i].name, a[i].school_num, a[i].score, a[i].major, a[i].dream);
	}


}